In [123]:
from numpy import genfromtxt
import pandas as pd
import numpy as np

In [124]:
def load_data_file(path="../data/orders.csv"):
    return pd.read_csv(path,sep=",",header=0)

In [125]:
dataset_ori = load_data_file()
dataset = dataset_ori.copy()

In [126]:
dataset_ori.head(5)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01
3,1b9131d69fb9745f0c22e22c6d55437f,4656415,21229235.0,1.0,7.37,2017-09-01
4,03c9fd0e00e2cef5d72d0af8e869aabe,4658541,21239714.0,1.0,16.66,2017-09-01

Max​ ​number​ ​of​ ​items​ ​in​ ​one​ ​order:​ ​if​ ​a​ ​customer​ ​has​ ​more​ ​than​ ​one​ ​order,​ ​take 
the​ ​one​ ​with​ ​more​ ​items.

In [127]:
dataset_max_num_items = dataset.groupby(['customer_id','order_id'])['num_items'].max()

In [128]:
dataset = dataset.join(dataset_max_num_items, ['customer_id','order_id'], rsuffix="_sum")
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0

Max​ ​revenue​ ​in​ ​one​ ​order:​ ​if​ ​a​ ​customer​ ​has​ ​more​ ​than​ ​one​ ​order,​ ​take​ ​the​ ​one 
with​ ​largest​ ​revenue.

In [129]:
dataset_max_revenue = dataset.groupby(['customer_id','order_id'])['revenue'].max()

In [130]:
dataset_max_revenue.head(3)

customer_id                       order_id
000011265b8a3727c4cc77b494134aca  4863832     42.01
000079318ce4bdc1897a9c711e107b55  4981158     21.00
0000e349e3d5eb96a2dc1939beebf9e4  4967674     20.82
Name: revenue, dtype: float64

In [131]:
dataset=dataset.join(dataset_max_revenue,['customer_id','order_id'], rsuffix="_max")
dataset.head(5)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00
3,1b9131d69fb9745f0c22e22c6d55437f,4656415,21229235.0,1.0,7.37,2017-09-01,1.0,7.37
4,03c9fd0e00e2cef5d72d0af8e869aabe,4658541,21239714.0,1.0,16.66,2017-09-01,1.0,23.32

Total​ ​revenue​ ​of​ ​a​ ​customer:​ ​including​ ​all​ ​orders

In [132]:
total_revenue_each_costumer = dataset.groupby('customer_id')['revenue'].sum()

In [133]:
total_revenue_each_costumer.head(3)

customer_id
000011265b8a3727c4cc77b494134aca    42.01
000079318ce4bdc1897a9c711e107b55    54.60
0000e349e3d5eb96a2dc1939beebf9e4    20.82
Name: revenue, dtype: float64

In [134]:
dataset = dataset.join(total_revenue_each_costumer,['customer_id'],rsuffix='_total')

Total​ ​number​ ​of​ ​orders

In [135]:
frequency_order_each_costumer = dataset.groupby(['customer_id'])['order_id'].count()

In [136]:
frequency_order_each_costumer.head(3)

customer_id
000011265b8a3727c4cc77b494134aca    1
000079318ce4bdc1897a9c711e107b55    3
0000e349e3d5eb96a2dc1939beebf9e4    1
Name: order_id, dtype: int64

In [137]:
dataset = dataset.join(frequency_order_each_costumer, ['customer_id'],rsuffix="_total")
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5

## how to select data based on value from other column

In [138]:
dataset.set_index(['customer_id'])
dataset.loc[dataset['customer_id'] == "450e1c2cbd21687780153995f1be0c23"]

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.0,55.41,5
2333,450e1c2cbd21687780153995f1be0c23,4661361,21253622.0,1.0,16.80,2017-09-01,2.0,21.0,55.41,5
3682,450e1c2cbd21687780153995f1be0c23,4661361,21253620.0,1.0,21.00,2017-09-01,2.0,21.0,55.41,5
9021,450e1c2cbd21687780153995f1be0c23,4661361,21253623.0,2.0,3.34,2017-09-01,2.0,21.0,55.41,5
11238,450e1c2cbd21687780153995f1be0c23,4661361,21253625.0,1.0,4.20,2017-09-01,2.0,21.0,55.41,5

In [139]:
#longest_date_each_costumer.head(10)

In [140]:
#ongest_date_each_costumer.columns = longest_date_each_costumer.columns.droplevel()

In [141]:
#longest_date_each_costumer

In [142]:
from datetime import datetime
def func(x):     
    gap_date = abs(datetime.strptime("2017-10-17", '%Y-%m-%d') - datetime.strptime(x, '%Y-%m-%d'))
    x=gap_date.days
    return x

Days​ since​ ​last​ ​order:​ ​number​ ​of​ ​days​ ​from​ ​the​ ​last​ ​order​ ​until​ ​2017-10-17

In [143]:
longest_date_each_costumer = dataset.groupby(['customer_id'])['created_at_date'].max()

In [144]:
longest_date_each_costumer = longest_date_each_costumer.apply(func)
longest_date_each_costumer.head(10)

customer_id
000011265b8a3727c4cc77b494134aca    18
000079318ce4bdc1897a9c711e107b55     2
0000e349e3d5eb96a2dc1939beebf9e4     4
0001159afe8b9309aeb95fa17886d688    26
000146a1e6decca6773a52afd2ed0255    20
0001aa41356a707949e8a715947ff85c    39
0001b3166c1bcb11f331e6676f7863a9    11
0001cf68347245f00fe71fd9d677e9df     6
00022da3f8257cbda32247d4e02c4b6d    18
0002ec88abff6d01da3b9db674cd8868     3
Name: created_at_date, dtype: int64

##POC that this is right
----------------------------------
===================================

In [145]:
dataset_ja = dataset.join(longest_date_each_costumer, ['customer_id'],rsuffix="_day")
dataset_ja.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,created_at_date_day
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5,46

In [146]:
dataset_ja.set_index(['customer_id'])
dataset_ja.loc[dataset_ja['customer_id'] == "000011265b8a3727c4cc77b494134aca"]

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,created_at_date_day
393773,000011265b8a3727c4cc77b494134aca,4863832,22235445.0,1.0,42.01,2017-09-29,1.0,42.01,42.01,1,18

===================================

In [147]:
dataset  = dataset.join(longest_date_each_costumer, ['customer_id'],rsuffix="_day")
dataset.rename(columns={'created_at_date_day':'day_since_last_order'}, inplace=True)
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,day_since_last_order
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5,46

The​ ​longest​ ​interval​ ​between​ ​two​ ​consecutive​ ​orders​ ​(in​ ​unit​ ​of​ ​days).​ ​If​ ​a 
customer​ ​has​ ​only​ ​one​ ​order,​ ​use​ ​the​ ​formula​ ​below

In [148]:
longest_date_interval = dataset.groupby(['customer_id']).agg({'created_at_date':['min','max']})

In [149]:
longest_date_interval['min'] = pd.to_datetime(longest_date_interval['created_at_date']['min'])

In [150]:
longest_date_interval['max'] = pd.to_datetime(longest_date_interval['created_at_date']['max'])

In [151]:
longest_date_interval.head(2)

                                 created_at_date                    min  \
                                             min         max
customer_id
000011265b8a3727c4cc77b494134aca      2017-09-29  2017-09-29 2017-09-29
000079318ce4bdc1897a9c711e107b55      2017-10-15  2017-10-15 2017-10-15

                                        max

customer_id
000011265b8a3727c4cc77b494134aca 2017-09-29
000079318ce4bdc1897a9c711e107b55 2017-10-15

In [152]:
longest_date_interval['gap_days'] = longest_date_interval['max'] - longest_date_interval['min']

In [153]:
def date_interval(x):
    return x.days 
longest_date_interval['gap_days'] = longest_date_interval['gap_days'].apply(date_interval)

In [154]:
longest_date_interval.drop(['created_at_date','min','max'],axis=1,inplace=True)
longest_date_interval.head(3)

                                 gap_days

customer_id
000011265b8a3727c4cc77b494134aca        0
000079318ce4bdc1897a9c711e107b55        0
0000e349e3d5eb96a2dc1939beebf9e4        0

In [155]:
longest_date_interval.columns

MultiIndex(levels=[['created_at_date', 'min', 'max', 'gap_days'], ['min', 'max', '']],
           labels=[[3], [2]])

In [156]:
longest_date_interval = longest_date_interval.reset_index()
longest_date_interval.columns = longest_date_interval.columns.remove_unused_levels().droplevel(level=1)
# longest_date_interval.columns = longest_date_interval.columns.droplevel(level=1)

print(longest_date_interval.head(3))
# longest_date_interval = longest_date_interval
# .remove_unused_levels().droplevel(level=1)

                        customer_id  gap_days
0  000011265b8a3727c4cc77b494134aca         0
1  000079318ce4bdc1897a9c711e107b55         0
2  0000e349e3d5eb96a2dc1939beebf9e4         0

In [157]:
print(longest_date_interval.columns)
longest_date_interval = longest_date_interval.set_index('customer_id')

Index(['customer_id', 'gap_days'], dtype='object')

In [158]:
dataset = dataset.join(longest_date_interval,['customer_id'])
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,day_since_last_order,gap_days
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46,0
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46,0
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5,46,0

In [159]:
avg_long_day = dataset['gap_days'].mean()

In [160]:
idx = dataset['gap_days'] == 0
# dataset
# dataset.apply(lambda x: replace_val(x['created_at_date'],avg_long_day))

In [161]:
dataset.loc[idx,'gap_days'] = avg_long_day + dataset.loc[idx,'day_since_last_order']

In [162]:
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,day_since_last_order,gap_days
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46,50.522772
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46,50.522772
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5,46,50.522772

change the data format to hdf5 because it's faster to read.

In [163]:
# import pandas as pd
# df= pd.DataFrame([True, True, False, False, False, False, True, False, False], 
#               index=pd.to_datetime(['2015-05-01', '2015-05-02', '2015-05-03',
#                                    '2015-05-04', '2015-05-05', '2015-05-06',
#                                    '2015-05-07', '2015-05-08', '2015-05-09']), 
#               columns=['A'])

In [164]:
datetime_now = datetime.now().strftime("%B_%d_%Y")
output_path = "/home/bukalapak/nietzsche/warehouse/datadump_{}.csv".format(datetime_now)

In [165]:
dataset.to_csv(output_path, sep=",")

In [172]:
dataset.head(3)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,day_since_last_order,gap_days
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46,50.522772
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46,50.522772
2,450e1c2cbd21687780153995f1be0c23,4661361,21253627.0,1.0,10.07,2017-09-01,2.0,21.00,55.41,5,46,50.522772

In [179]:
type(dataset)

pandas.core.frame.DataFrame

In [195]:
jaja= dataset.loc[dataset['customer_id']=="450e1c2cbd21687780153995f1be0c23"]

In [200]:
dataset.head(2)

,customer_id,order_id,order_item_id,num_items,revenue,created_at_date,num_items_sum,revenue_max,revenue_total,order_id_total,day_since_last_order,gap_days
0,37d67f5feef4cb754056a54841e43ad9,4662083,21257304.0,1.0,24.79,2017-09-01,1.0,24.79,24.79,1,46,50.522772
1,d0d7a76fea3729a9381d39aca78b52d3,4655291,21224156.0,1.0,22.68,2017-09-01,1.0,22.68,22.68,1,46,50.522772

In [208]:
type(dataset[['customer_id','order_id']].values)

numpy.ndarray

In [209]:
dataset[['customer_id','order_id']].values

array([['37d67f5feef4cb754056a54841e43ad9', 4662083],
       ['d0d7a76fea3729a9381d39aca78b52d3', 4655291],
       ['450e1c2cbd21687780153995f1be0c23', 4661361],
       ...,
       ['d04aacce88882e97c857fc89a429407f', 4986545],
       ['66029fa806c4139dd607634338d31246', 4990011],
       ['655ba4047d7abd2528a30a4251c22f79', 4987791]], dtype=object)